Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/help_with_buying_a_home/paying_for_a_home.html.txt.tmx
Source language: en
Languages: ga

source: • Assessing a mortgage offer • Paying the mortgage
ga: • Measúnú a dhéanamh ar thairiscint mhorgáiste

source: If you are buying a home, you will probably have to take out a mortgage, which is a long-term loan to finance a property purchase
ga: Murar féidir leat an teach a cheannach thar barr amach, beidh ort morgáiste a fháil, ar iasacht fhadtéarmach é a úsáidtear chun ceannach réadmhaoine a mhaoiniú

source: If you cannot get a mortgage from a commercial lender (bank) you may be eligible for a loan from a local authority
ga: Déanfar do theach a urrú i leith na hiasachta, mar sin, mura leanann tú le d’íocaíochtaí a dhéanamh, d’fhéadfá bheith i mbaol do theach a chailleadh

source: As your home will be secured against the loan, you must keep up your payments or risk losing your home
ga: Is iad na príomhfhoinsí morgáistí iasachtóirí tráchtála, ar nós banc

source: This document outlines some issues to consider when thinking of taking out a mortgage, topping up an existing home loan or switching to a different mortgage product – known as a switcher mortgage
ga: Tugtar cuntas sa cháipéis seo ar shaincheisteanna ar fiú machnamh a dhéanamh orthu nuair a bhíonn tú ag smaoineamh ar mhorgáiste a fháil, iasacht reatha tí a bhreisiú nó aistriú chuig táirge éagsúil morgáiste – ar a dtugtar morgáiste aistrithe

source: It is aimed at private individuals who are buying their own homes
ga: Tá sé dírithe ar dhaoine aonair príobháideacha a bhfuil a dtithe féin á gceannach acu

source: Note that mortgage interest relief is no longer available for new mortgages
ga: Is féidir leat níos mó a léamh inár gcáipéis ar na costais a bhaineann le ceannach tí

source: However, if you are a first-time buyer, you may be entitled to claim First Time Buyers Relief, which is a refund of Deposit Interest Retention Tax (DIRT)
ga: Tá treoir áisiúil céim ar chéim maidir le teach a cheannach ar consumerhelp.ie Tabhair faoi deara nach bhfuil faoiseamh i leith ús morgáiste ar fáil a thuilleadh do mhorgáistí nua

source: An income tax rebate, the Help-to-Buy (HTB) incentive, has been introduced to help first-time buyers of newly built homes to fund the deposit required. It also applies to once-off self-build homes
ga: Má tá morgáiste agat cheana féin agus má tá athstruchtúrú á chur ar tairiscint duit mar gheall ar dheacrachtaí íocaíochta, léigh ár gcáipéis ar shocruithe athstruchtúraithe morgáiste

source: Read more about the HTB incentive
ga: Cé mhéid is féidir liom a fháil ar iasacht?

source: Commercial lenders offer a range of mortgage rates and products
ga: Cuireann iasachtóirí tráchtála réimse de rátaí agus táirgí morgáiste ar fáil

source: Before starting to look for a home, you should check with potential lenders to get a statement of how much they are prepared to lend you
ga: Sula ndéanann tú teach a chuardach, ba cheart duit seiceáil a dhéanamh le hiasachtóirí féideartha chun ráiteas a fháil ar cé mhéid atá siad sásta a thabhairt ar iasacht duit

source: This is called approval in principle
ga: Tugtar faomhadh i bprionsabal air seo

source: Getting approval in principle will indicate what price range you can consider when looking for somewhere to buy
ga: Trí fhaomhadh i bprionsabal a fháil, tabharfar le fios duit cén praghasréimse is féidir leat machnamh a dhéanamh air nuair a bhíonn áit á cuardach agat le ceannach

source: However, approval in principle doesn’t mean that the lender has approved a mortgage and agreed to lend you this amount
ga: Ní chiallaíonn faomhadh i bprionsabal, áfach, gur fhaomh an t-iasachtóir morgáiste agus gur chomhaontaigh sé/sí chun an méid seo a thabhairt ar iasacht duit

source: The official mortgage approval is contained in a letter of offer, which the lender will only issue when it is fully satisfied with certain matters, including a valuation of the property you are buying
ga: Leag Banc Ceannais na hÉireann teorainneacha ar mhéid na n-iasachtaí tí a thugann iasachtóirí tráchtála a rialaíonn siad. Déantar cur síos ar na teorainneacha nua ar consumerhelp.ie agus i gCeisteanna Coitianta (pdf) an Bhainc Cheannais

source: Under Regulations in effect since 9 February 2015, the Central Bank set limits on the size of housing loans made by the commercial lenders that it regulates
ga: Baineann na teorainneacha seo le hiasachtaí a fhaomhtar i bprionsabal i ndiaidh gur tháinig Rialacháin (pdf) nua i bhfeidhm an 9 Feabhra 2015

source: Following an evaluation and consultation process, the Central Bank announced in November 2016 that revised limits would take effect from 1 January 2017, under new Regulations
ga: (Ní bheidh iasachtaí a faomhadh i bprionsabal roimh an dáta seo díolmhaithe má thug an t-iasachtóir faoi mheasúnú iomlán creidmheasa lena dtacaíonn faisnéis fhíoraithe airgeadais sular faomhadh iad.)

source: The limits are described on consumerhelp.ie and on the Central Bank’s website
ga: Tá scaoileadh cothromais agus breisiú ar mhorgáiste reatha araon laistigh de scóip na dteorainneacha

source: Equity release and top-up on an existing mortgage are both within the scope of the limits, but they do not apply to switcher mortgages, or to the restructuring of mortgages in arrears or pre-arrears
ga: Ní bhaineann siad le morgáistí aistrithe, nó le hathstruchtúrú morgáistí a bhfuil riaráistí nó réamhriaráistí acu

source: How the limits work
ga: Conas mar a oibríonn na teorainneacha

source: There are 2 types of limit – one based on the ratio of the loan to the price of the house – known as loan-to-value or LTV – and the other based on the ratio of the loan to the income(s) of the borrower(s) – known as loan-to-income or LTI
ga: Tá 2 shaghas de theorainn ann – ceann amháin atá bunaithe ar chóimheas na hiasachta i leith phraghas an tí – ar a dtugtar ‘iasacht i gcoinne luacha’ nó IGL – agus tá an ceann eile bunaithe ar chóimheas na hiasachta i leith ionca(i)m an iasachtóra/na n-iasachtóirí – ar a dtugtar ‘iasacht i gcoinne ioncaim’ nó IGI

source: In general, both of these limits will have to be met for the mortgage to meet the Central Bank’s requirements
ga: Go ginearálta, beidh an dá theorainn seo le comhlíonadh go gcomhlíonfaidh an morgáiste riachtanais an Bhainc Cheannais

source: However, the Regulations allow lenders to be flexible in some cases – see ‘Lender flexibility’ below
ga: Cuirfidh na Rialacháin ar chumas iasachtóirí a bheith solúbtha i roinnt cásanna, áfach

source: As well as meeting the limits, the lender must also assess each loan application on a case-by-case basis – see ‘Assessment by the lender’ below
ga: Mar aon leis na teorainneacha a chomhlíonadh, ní mór don iasachtóir measúnú a dhéanamh ar gach iarratas ar iasacht ar bhonn cás ar chás – féach ‘Measúnú ag an iasachtóir’ thíos

source: There is a general limit of 3.5 times gross annual income for all new mortgage lending for principal dwelling homes, with some scope for flexibility
ga: Cuirtear teorainn ghinearálta ar gach iasachtú morgáiste nua chun 3.5 uair an ollioncaim bhliantúil a fháil ar iasacht i gcás tithe príomha cónaithe, agus bíonn roinnt scóipe le haghaidh solúbthachta ann

source: This includes lending to people in negative equity who are applying for a mortgage for a new property
ga: Áirítear leis seo iasachtú le daoine a bhfuil cothromas diúltach acu a bhfuil iarratas á dhéanamh acu ar mhorgáiste le haghaidh maoin nua

source: This limit does not apply to buy-to-let mortgages
ga: Ní bhaineann an teorainn seo le morgáistí ceannach le ligean

source: Again, lenders have some scope for flexibility – see ‘Lender flexibility’ below
ga: Tá teorainneacha éagsúla ann le haghaidh catagóirí éagsúla ceannaitheora

source: Withe effect from 1 January 2017, this increased to 4 months
ga: Arís eile, bíonn roinnt scóipe ag iasachtóirí le bheith solúbtha

source: Up to 31 December 2016: For first-time buyers of principal dwelling homes there was a limit of 90% LTV on the first €220,000 of the value of a residential property, so first-time buyers needed a deposit of 10% for a house or apartment costing €220,000 or less
ga: I gcás ceannaitheoirí céaduaire tithe príomha cónaithe, cuirtear teorainn 90% den IGL ar an gcéad €220,000 de luach na maoine cónaithe, mar sin, teastóidh éarlais 10% ó cheannaitheoirí céaduaire chun teach nó árasán a chosnaíonn €220,000 nó níos lú a fháil

source: A limit of 80% LTV applied on any excess value of the property above €220,000, so first-time buyers needed a deposit of 10% on the first €220,000 and 20% of any balance above €220,000
ga: Cuirtear teorainn 80% den IGI ar aon luach breise atá ar an maoin os cionn €220,000, mar sin, teastóidh éarlais 10% ar an gcéad €220,000 agus éarlais 20% ar aon iarmhéid os cionn €220,000 ó cheannaitheoirí céaduaire

source: For non-first-time home-buyers, there is a limit of 80% of LTV on new mortgage lending, whatever the price of the property, so they will need a deposit of 20% of the total purchase price
ga: I gcás ceannaitheoirí tí nach ceannaitheoirí céaduaire iad, cuirtear teorainn 80% den IGI ar iasachtú morgáiste nua, gan aird ar phraghas na maoine, mar sin, teastóidh éarlais 20% den phraghas iomlán ceannaigh uathu

source: For properties other than principal dwelling homes, including buy-to-let properties, a limit of 70% LTV applies
ga: I gcás maoin eile seachas tithe príomha cónaithe, maoin cheannaigh chun ligean san áireamh, cuirtear teorainn 70% den IGI i bhfeidhm

source: The LTV limits do not apply to borrowers in negative equity applying for a mortgage for a new property. However, lenders may still opt to apply stricter lending standards, based on their assessment of each case. Lender flexibility
ga: Ní bhaineann na teorainneacha IGI le hiasachtóirí a bhfuil cothromas diúltach acu a bhfuil iarratas á dhéanamh acu ar mhorgáiste le haghaidh maoin nua

source: Originally, the rules also allowed for 15% of total lending for all primary dwellings in a calendar year (for all buyers, first-time and others) to be above the LTV limits
ga: Féadfaidh iasachtóirí a roghnú fós féin chun caighdeáin iasachtaithe níos déine a chur i bhfeidhm, áfach, bunaithe ar an measúnú a dhéanann siad ar gach cás

source: Summary of LTV limits
ga: Achoimre ar theorannacha IGI

source: │Type of buyer │House price │Maximum limit of mortgage – up to end 2016 │Maximum limit of mortgage – from January 2017 │Minimum amount of deposit – up to end 2016 │Minimum amount of deposit – from January 2017 │
ga: │Saghas an cheannaitheora │Praghas an tí │Teorainn uasta an mhorgáiste │Íosmhéid na héarlaise │

source: │First-time │Up to and including €220,000 │90% of house price │90% of house price │10% of house price │10% of house price │
ga: │Céaduaire │A mhéid le €220,000 agus an tsuim sin san áireamh │90% de phraghas an tí │10% de phraghas an tí │

source: │ │ │90% of the first €220,000 │ │10% of the first €220,000 │ │
ga: │ │ │90% den chéad €220,000 │10% den chéad €220,000 │

source: │First-time │Over €220,000 │ │90% of house price │ │10% of house price │
ga: │Céaduaire │Os cionn €220,000 │ │ │

source: │ │ │plus 80% of the excess over €220,000 │ │plus 20% of the excess over €220,000 │ │
ga: │ │ │móide 80% den bharrachas os cionn €220,000 │móide 20% den bharrachas os cionn €220,000 │

source: │Not first-time │Any │80% of house price │80% of house price │20% of house price │20% of house price │
ga: │Ceannaitheoirí nach ceannaitheoirí céaduaire iad │Aon suim │80% de phraghas an tí │20% de phraghas an tí │

source: │In negative equity on current mortgage │Any │These limits don’t apply but the lender’s own limits may be stricter │
ga: │Cothromas diúltach ag an iasachtaí ar mhorgáiste reatha │Aon suim │Ní bhaineann na teorainneacha seo ach d’fhéadfadh teorainneacha féin an iasachtóra bheith níos déine │

source: │Buy-to-let or other non-principal dwelling │Any │70% of house price │ │30% of house price │ │
ga: │Morgáiste ceannaigh le ligean │Aon suim │70% de phraghas an tí │30% de phraghas an tí │

source: Assessing a mortgage offer
ga: Measúnú a dhéanamh ar thairiscint mhorgáiste

source: It is very important for you to be satisfied that the mortgage is affordable from your point of view and that it is sustainable – you should be able to keep up the repayments over the lifetime of the mortgage. Information about the offer
ga: Ní mór do d’iasachtóir a gcinneadh iasachtaithe a bhunú ar mheasúnú mionsonraithe a dhéanamh ar do chuid cúinsí

source: Under the European Union (Consumer Mortgage Credit Agreements) Regulations 2016, which transposed the Mortgage Credit Directive into Irish law, the lender must provide you with a European Standardised Information Sheet (ESIS), setting out the details of the mortgage offer
ga: Anuas air sin, tá sé an-tábhachtach go mbíonn tú sásta go bhfuil an morgáiste inacmhainne duit i dtaobh do dhearcaidh féin agus go bhfuil sé inbhuanaithe – ba cheart go mbeifeá in ann leanúint leis na haisíocaíochtaí a dhéanamh thar shaolré an mhorgáiste

source: Information on the various types of mortgage is available on consumerhelp.ie, along with a set of mortgage calculators that you can use to work out your monthly repayments and the effects of a rate change
ga: Tá fáil ar fhaisnéis ar na saghsanna éagsúla de mhorgáistí ar consumerhelp.ie, mar aon le sraith d’áireamháin mhorgáiste ar féidir leat úsáid a bhaint astu chun d’aisíocaíochtaí míosúla a dheimhniú agus chun an tionchar a imreoidh athrú ráta a dheimhniú

source: You should work out your income and expenditure and assess how they are likely to change over time, depending on your employment situation, your family situation and your stage in life
ga: Ba cheart duit d’ioncam agus do chaiteachas a dheimhniú agus measúnú a dhéanamh ar conas is dóchúil go dtiocfaidh athrú orthu le himeacht ama, ag brath ar do chás fostaíochta, cás do theaghlaigh agus an chéim atá bainte amach agat i do shaol

source: You can use these budgeting calculators as a starting point
ga: Féadfaidh tú na háireamháin bhuiséadta seo a úsáid mar phointe tosaigh

source: You may wish to look for financial advice
ga: B’fhéidir gur mian leat comhairle airgeadais a lorg

source: Consumerhelp.ie explains the different types of adviser available
ga: Mínítear ar consumerhelp.ie na saghsanna éagsúla de chomhairleoir atá ar fáil

source: It lists questions to ask and steps to take when shopping around for financial advice
ga: Liostaítear na ceisteanna is fiú a chur agus na céimeanna atá le glacadh nuair a bhíonn géarshiopadóireacht á déanamh agat chun comhairle airgeadais a fháil

source: A mortgage loan is a serious and long-term commitment
ga: Ceangaltas tromchúiseach agus fadtéarmach is ea iasacht mhorgáiste

source: You’ll need to do your research and ask some questions about the loan and its implications over the long term, such as:
ga: Beidh ort do chuid taighde a dhéanamh agus roinnt ceisteanna a chur faoin iasacht agus impleachtaí na hiasachta san fhadtéarma, ar nós na n-impleachtaí a leanas:

source: • How does the interest rate (APR) compare to others in the market?
ga: • Conas mar atá an ráta úis (an Ráta Céatadánach Bliantúil) i gcomparáid le cinn eile sa mhargadh?

source: • Research the lender’s policy and track record on changing interest rates
ga: • Taighde a dhéanamh ar bheartas agus cuntas teiste an iasachtóra ar rátaí úis a athrú

source: Even a small variation in interest rates can have a large effect on the overall cost of your mortgage
ga: D’fhéadfadh fiú athrú beag ar rátaí úis tionchar mór a imirt ar chostas foriomlán do mhorgáiste

source: You can use this mortgage rate calculator to assess these effects
ga: Féadfaidh tú an t-áireamhán ráta morgáiste seo a úsáid chun measúnú a dhéanamh ar an tionchar seo

source: • Can I realistically afford to keep up the monthly payments if my income falls or my outgoings increase?
ga: • An bhfuil sé inacmhainne dom leanúint leis na híocaíochtaí míosúla a dhéanamh má thagann laghdú ar m’ioncam nó má mhéadaítear m’íocaíochtaí amach?

source: You need to assess your continuing ability to repay as circumstances change over time
ga: Is gá duit measúnú a dhéanamh ar do dhliteanas leantach chun aisíocaíochtaí a dhéanamh mar gheall go n-athraíonn cúinsí le himeacht ama

source: • If I accept an introductory offer, will I be able to manage when the ‘introductory’ period is over?
ga: • Má ghlacaim le tairiscint tosaigh, an éireoidh liom nuair a bheidh an tréimhse ‘thosaigh’ thart?

source: Again, you need to calculate your ability to repay – over the full term of the mortgage, not just the first few years
ga: Arís eile, is gá duit d’acmhainn a ríomh chun aisíocaíocht a dhéanamh – i gcaitheamh théarma iomlán an mhorgáiste, seachas na chéad chúpla bliain

source: • What insurance do I need on the mortgage?
ga: • Cén t-árachas a theastaíonn uaim ar an morgáiste?

source: Read about insurance protection on mortgages
ga: Is féidir leat tuilleadh a léamh faoi chosaint árachais ar mhorgáistí

source: Assessment by the lender
ga: Measúnú ag an iasachtóir

source: In addition to the Central Bank’s lending limits, its Consumer Protection Code 2012 requires all regulated lenders to assess your personal circumstances and financial situation thoroughly before agreeing to provide a mortgage
ga: Anuas ar theorainneacha nua iasachtaithe an Bhainc Cheannais, ceanglaíonn a gCód um Chosaint Tomhaltóirí 2012 ar gach iasachtóir rialáilte chun measúnú críochnúil a dhéanamh ar do chúinsí pearsanta agus ar do chás airgeadais sula gcomhaontaíonn siad chun morgáiste a sholáthar

source: When offering you a mortgage, the lender must give you a written statement, setting out the reasons why the mortgage product being offered is considered suitable for your needs, objectives and circumstances
ga: Ní mór don iasachtóir tabhairt faoi mheasúnuithe mionsionraithe ar inacmhainneacht an táirge atá a chur ar fáil agus ar oiriúnacht an táirge duit

source: The European Union (Consumer Mortgage Credit Agreements) Regulations 2016 also require lenders to conduct a creditworthiness assessment prior to offering a mortgage loan
ga: Nuair a chuirtear morgáiste ar tairiscint duit, ní mór don iasachtóir ráiteas scríofa a thabhairt duit ina leagtar amach na cúiseanna a meastar go bhfuil an táirge atá á chur ar tairiscint duit oiriúnach do do chuid riachtanas, cuspóirí agus cúinsí

source: Once you have taken out the mortgage, you are now committed to paying the monthly instalments as agreed in the contract with your lender
ga: A luaithe a ghlac tú an morgáiste amach, tugann tú gealltanas chun na tráthchodanna míosúla a íoc, faoi mar a ndéantar comhaontú air sa chonradh le d’iasachtóir

source: You should keep all correspondence and documentation from your lender in a safe place, as well as documents relating to insurance on your mortgage, house and contents
ga: Ba cheart duit an comhfhreagras agus an cháipéisíocht go léir ó d’iasachtóir a choimeád in áit shábháilte, mar aon le cáipéisí a bhaineann le hárachas ar do mhorgáiste, do theach agus d’inneachar

source: It is very important to keep up your mortgage repayments
ga: Tá sé rí-thábhachtach leanúint le d’aisíocaíochtaí morgáiste a dhéanamh

source: If you don’t, your credit rating will be damaged and your home will be at risk
ga: Mura ndéanann tú sin, déanfar difear do do rátáil chreidmheasa agus beidh do theach i mbaol

source: Problems paying the mortgage
ga: Fadhbanna leis an morgáiste a íoc

source: If you are having difficulty managing your finances, there are several things you can do
ga: Má bhíonn fadhbanna agat le d’airgeadas a bhainistiú, tá roinnt rudaí ann is féidir leat a dhéanamh

source: The Money Advice and Budgeting Service (MABS) can help you to review your income and your outgoings, make out a budget and deal with your debts in general
ga: Féadfaidh an tSeirbhís Bhuiséadta agus Chomhairle Airgid (an SBCA) cabhrú leat chun athbhreithniú a dhéanamh ar d’ioncam agus d’íocaíochtaí amach, agus chun buiséad a dhéanamh agus chun déileáil le d’fhiachais go ginearálta

source: Even if you have not yet missed a mortgage payment, you are protected by the Central Bank’s Code of Conduct on Mortgage Arrears if you contact your lender and let them know that you are having a problem
ga: Fiú murar theip ort íocaíocht mhorgáiste a dhéanamh go dtí seo, tá tú faoi chosaint Chód Iompair um Riaráistí Morgáiste an Bhainc Cheannais má dhéanann tú teagmháil le d’iasachtóir agus má chuireann tú ar an eolas iad go bhfuil fadhb agat

source: To discuss these and other options, you can call the dedicated Mortgage Arrears Information Helpline, which is operated by MABS. Find out more on keepingyourhome.ie
ga: Chun plé a dhéanamh orthu seo agus ar roghanna eile, féadfaidh tú glao ar an Líne Chabhrach um Fhaisnéis ar Riaráistí Morgáiste, a oibríonn an SBCA

source: You can read more in our document on the costs of buying a home
ga: Tá fáil ar thuilleadh faisnéise ar keepingyourhome.ie
